content/euler/47.md
+++
title = "Project Euler 47: Distinct Prime Factors"
author = ["Gautam Manohar"]
description = "My solution to problem 47 of Project Euler."
date = 2018-07-16
tags = ["primes"]
categories = ["euler"]
draft = false
+++

## Problem Statement {#problem-statement}

The first two consecutive numbers to have distinct prime factors are \\(14 =
2\cdot7\\) and \\(15 = 3\cdot5\\). The first three consecutive such numbers are

\begin{equation\*}
\begin{split}
644 &= 2^2 \cdot 7 \cdot 23,\\\\\\
645 &= 3 \cdot 5 \cdot 43,\\\\\\
646 &= 2 \cdot 17 \cdot 19
\end{split}
\end{equation\*}

Find all the sets of \\(K\\) consecutive integers (whose first integer is less than
\\(N\\)) that each have exactly
\\(K\\) distinct prime factors. Print the first number of each set in ascending
order.


## My Algorithm {#my-algorithm}

The mathematical notation for the number of distinct prime factors of \\(n\\) is
\\(\omega(n)\\) (we write \\(\Omega(n)\\) for the total number of prime factors, counting
multiplicity). We use a modified Sieve of Eratosthenes: instead of storing
whether \\(n\\) is prime, we store \\(\omega(n)\\). Whenever we hit an \\(n\\) with
\\(\omega(n) = 0\\), we find all the multiples of \\(n\\) less than \\(N\\) and add one to
the associated value. Then, we search through all sets of \\(K\\) consecutive
elements in the array and check whether they all have exactly \\(K\\) distinct prime
factors.